Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltPlainHoleTypeEnum Enumeration
 The plain hole type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BoltPlainHoleTypeEnum
Public Enumeration BoltPlainHoleTypeEnum
Members
Member name | Value | Description
HOLE_TYPE_THROUGH | 0 |  The through hole type.
HOLE_TYPE_BLIND | 1 |  The blind hole type.
See Also
Reference
Tekla.Structures.Model Namespace